#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.eks.aws_iam_policy.alertmanager_publishable: Refreshing state... [id=arn:aws:iam::865518846931:policy/MyFirstCluster-alertmanager-publishable-policy]
module.eks.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0be9f882f22799ca2]
module.eks.aws_sns_topic.alertmanager: Refreshing state... [id=arn:aws:sns:ap-northeast-1:865518846931:MyFirstCluster_alertmanager_topic]
module.eks.aws_iam_policy.alertmanager_subscribable: Refreshing state... [id=arn:aws:iam::865518846931:policy/MyFirstCluster-alertmanager-subscribable-policy]
module.eks.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0e277b5e645e45ff3]
module.eks.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a364be80932c73ff]
module.eks.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b352c6ec07bd6caf]
module.eks.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-05713a0cee28d43d9]
module.eks.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-099d8f8f29ca320ae]
module.eks.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a364be80932c73ff1080289494]
module.eks.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-00e061b9b6d784cae]
module.eks.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05a2ffc6a0bfc69a1]
module.eks.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d221d2cff6984462]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.eks.aws_iam_policy.alertmanager_publishable will be destroyed
  # (because aws_iam_policy.alertmanager_publishable is not in configuration)
  - resource "aws_iam_policy" "alertmanager_publishable" {
      - arn       = "arn:aws:iam::865518846931:policy/MyFirstCluster-alertmanager-publishable-policy" -> null
      - id        = "arn:aws:iam::865518846931:policy/MyFirstCluster-alertmanager-publishable-policy" -> null
      - name      = "MyFirstCluster-alertmanager-publishable-policy" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sns:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-northeast-1:865518846931:MyFirstCluster_alertmanager_topic"
                      - Sid      = "alertmanagerPublish"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA4TBHRQPJQNBWZVBLB" -> null
      - tags      = {
          - "ClusterName" = "MyFirstCluster"
        } -> null
      - tags_all  = {
          - "ClusterName" = "MyFirstCluster"
        } -> null
    }

  # module.eks.aws_iam_role.alertmanager_publisher will be created
  + resource "aws_iam_role" "alertmanager_publisher" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = ""
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "MyFirstCluster_alertmanager_publisher"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "ClusterName" = "MyFirstCluster"
        }
      + tags_all              = {
          + "ClusterName" = "MyFirstCluster"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "alertmanager_publisher_inline_policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "sns:Publish"
                          + Effect   = "Allow"
                          + Resource = "arn:aws:sns:ap-northeast-1:865518846931:MyFirstCluster_alertmanager_topic"
                          + Sid      = "alertmanagerPublish"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + alertmanager_publisher_role_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @shogotsuneto, Action: `pull_request`*